# StopOnError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..StopOnError Property
PDFExportOptions Class See Also
---
Whether export process should stop when a view fails to export
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool StopOnError { get; set; }
```

Visual Basic
---
```text
Public Property StopOnError As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool StopOnError {
	bool get ();
	void set (bool value);
}
```

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace